exampleCase/pressuriztionLN2tank/constant/phaseChangeProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseChangeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseChangeTwoPhaseModel lee;

Coeffs
{
    coeffC          0.6;
    coeffE          0.6;
    Ptl             2.3;
    Ptg             0.8;
    qw              6;
}

saturationProperty
{
    hf          200000;
    C<8>           (69.5346 7.7084e-5 0 0 0 0 0 0);
}

// ************************************************************************* //
