exampleCase/pressuriztionLN2tank/constant/thermophysicalProperties.vapor
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState PengRobinsonGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   28;
    }
    equationOfState
    {
        Tc      126.2;
        Vc      0.00318;
        Pc      3.4e6;
        omega   0.0372;
    }    
    thermodynamics
    {
        Cp          1100;
        Hf          0;
    }
    transport
    {
        mu          5.85e-06;
        Pr          0.82;
    }
}


// ************************************************************************* //
